{"sender": "welcome@zoho.com", "receiver": null, "subject": "Access from anywhere, anytime!", "content": "\n\n \n  \n \nHello,\n\n\n\nWe created Zoho Mail, and its complementary mobile apps, to turn your monotonous email routine into an enjoyable experience. Never lose access to your email, wherever you are! \n\n\n\nZoho Mail\n\n\n\n\n\nThis is the app you use to check your email, set reminders about important emails, find elusive attachments, and schedule your meetings in a calendar. Above is a short video explaining all the things you can do with the app. You can read more about it here.\n\n\n\n\nInbox Insight\n\n\n\nIf you are overwhelmed by an avalanche of emails everyday, then Inbox Insight is your solution. An email app unlike any other, Inbox Insight is a search engine for your inbox. Here's how it works.\n\n\n\n\nZoho Mail Admin App\n\n\n\n\n\nAdministrators are always on the lookout for help. Here is an App that lets you do it anywhere you want! Password reset, storage management, and mail moderation are some of the things you can do with this app. Check out more details here.\n\n\n\nStreams App\n\n\n\nChange the way team collaboration happens through email, by changing the way you interact with an email. Right from your phone. Learn More.\n\n\n\nApps that work along with Zoho Mail\n\n\n\n\nTaskz syncs with the tasks inside Zoho Mail. Card Scanner scans business cards and automatically adds them to your Zoho Mail contacts. Zoho Cliq lets you continue your conversations, wherever you are. Learn more about these apps. \n\n\n\nZoho Mail on other Email clients\n\n\n\nIf you prefer to use other email clients, we support IMAP, POP and ActiveSync. Here's how you configure IMAP for iOS, Android and Windows phones. \n\n\n\nZoho Mail on mobile browser\n\n\n\nYou can also access Zoho Mail on our mobile optimized website, m.zoho.com/mail, or our tablet optimized website, t.zoho.com/mail. \n\n\n\nTake a look at our entire range of mobile apps for Zoho Mail here.\n\n\n\n\n\n- Zoho Mail Team\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "file": null}